## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.aws_iam_policy_document.write_to_bucket will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "write_to_bucket" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # aws_iam_role_policy.write_to_bucket will be created
  + resource "aws_iam_role_policy" "write_to_bucket" {
      + id     = (known after apply)
      + name   = "write_to_salesforce_bucket"
      + policy = (known after apply)
      + role   = "salesforce-backup-oidc"
    }

  # module.cds_salesforce_backups_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "cds-salesforce-backups"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "platform-core-services"
          + "Critical"   = "true"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "platform-core-services"
          + "Critical"   = "true"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = false

              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.cds_salesforce_backups_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.cds_salesforce_backups_logs_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "cds-salesforce-backups-access-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "platform-core-services"
          + "Critical"   = "false"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "platform-core-services"
          + "Critical"   = "false"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = false

              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }
    }

  # module.cds_salesforce_backups_logs_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.oidc.aws_iam_role.this["salesforce-backup"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = [
                                  + "repo:cds-snc/salesforce_backup:ref:refs/heads/main",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::563894450011:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "salesforce-backup"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "CostCentre" = "platform-core-services"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "platform-core-services"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.cds_salesforce_backups_bucket.aws_s3_bucket.this,
  on .terraform/modules/cds_salesforce_backups_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_versioning resource instead

(and 6 more similar warnings elsewhere)
Releasing state lock. This may take a few moments...
time=2023-05-19T19:44:49Z level=warning msg=No double-slash (//) found in source URL /home/runner/work/salesforce-backup/salesforce-backup/terragrunt. Relative paths in downloaded Terraform code may not work.

Error: Incorrect attribute value type

  on iam.tf line 43, in resource "aws_iam_role_policy_attachment" "oidc":
  43:   policy_arn = aws_iam_role_policy.write_to_bucket
    ├────────────────
    │ aws_iam_role_policy.write_to_bucket is object with 5 attributes

Inappropriate value for attribute "policy_arn": string required.
time=2023-05-19T19:44:57Z level=error msg=Terraform invocation failed in /home/runner/work/salesforce-backup/salesforce-backup/terragrunt/.terragrunt-cache/bo-ty3C-FlMiwRDo2g-_XFFW9K4/5_vtwQynCKY-lSqxmikpUl4R9ms prefix=[/home/runner/work/salesforce-backup/salesforce-backup/terragrunt] 
time=2023-05-19T19:44:57Z level=error msg=1 error occurred:
	* [/home/runner/work/salesforce-backup/salesforce-backup/terragrunt/.terragrunt-cache/bo-ty3C-FlMiwRDo2g-_XFFW9K4/5_vtwQynCKY-lSqxmikpUl4R9ms] exit status 1



```

</details>

